In [ ]:
series : 1차원으로 이루어진 데이터 배열
DataFrame : 2차원으로 이루어진 데이터 배열

In [4]:
import pandas as pd
pd

# Pandas 의 Series 와 DataFrame

1차원, 1개의 column은 Series라고 합니다.

In [5]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
a = [1, 2, 3, 4]
pd.Series(a)

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
mylist = [1, 2, 3, 4]
pd.Series(mylist)

0    1
1    2
2    3
3    4
dtype: int64

# DataFrame

방법 1. list로 만들기

In [12]:
company1 = [['삼성', 2000, '스마트폰'],
           ['현대', 1000, '자동차'],
           ['네이버', 500, '포털']]

In [14]:
pd.DataFrame(company1)

     0     1     2
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [15]:
df1 = pd.DataFrame(company1)
df1

     0     1     2
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

제목 컬럼 만들기

In [36]:
df1.columns = ['기업명','매출액','업종']
df1.index = ['첫 번째', '두 번째', '세 번째']
df1

      기업명   매출액    업종
첫 번째   삼성  2000  스마트폰
두 번째   현대  1000   자동차
세 번째  네이버   500    포털

방법2. dict로 만들기

In [20]:
company2 = {'기업명':['삼성','현대','네이버'],
           '매출액': [2000, 1000, 500],
           '업종': ['스마트폰', '자동차', '포털']
           }
df2 = pd.DataFrame(company2)
df2

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

index를 특정 column으로 지정하기

In [24]:
df1
df1.index = df1['기업명']
df1

     기업명   매출액    업종
기업명
삼성    삼성  2000  스마트폰
현대    현대  1000   자동차
네이버  네이버   500    포털

series = column 이라고 하였습니다. 확인해 볼까요?

In [26]:
df1['매출액']

기업명
삼성     2000
현대     1000
네이버     500
Name: 매출액, dtype: int64

In [37]:
type(df1['매출액'])

pandas.core.series.Series

# 1. CSV 파일 읽어오기

CSV 파일 이란?
    Comma Separated Value의 약어로써, 쉼표로 구분된 파일
    엑셀을 로딩할 수도 있지만, 쉼표로 구분된 파일이 훨씬 가볍다
    공공데이터포털 에서도 CSV 포맷의 파일을 제공한다.